Documents/РеализацияОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияОпционов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадрыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаПродажуОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПродажуОпционов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпционовДляПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияОпционов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеПроцедура ПриОткрытии(Отказ, СтандартнаяОбработка)    Если ЭтотОбъект.ПакетОпционов <> Неопределено Тогда        ПолучениеДоступныхОпционов(ЭтотОбъект.ПакетОпционов);    КонецЕсли;КонецПроцедуры  

&НаКлиенте
Процедура ПолучениеДоступныхОпционовКоманда(Команда)  
	 ПолучениеДоступныхОпционов(ЭтотОбъект.Объект.ПакетОпционов)
КонецПроцедуры

Процедура ПолучениеДоступныхОпционов(ПакетыОпционов)
    ОбъектПакета = ПакетыОпционов.ПолучитьОбъект();  
	ЭтотОбъект.Объект.ДоступныеОпционы = ПакетыОпционов.ОстатокОпционов; // отображение количества доступных опционов
	ОбъектПакета.записать();
КонецПроцедуры  


  

&НаКлиентеПроцедура КомандаПровестиИЗакрыть(Команда)  	ПродажаОпционов(ЭтотОбъект.Объект.ПакетОпционов, ЭтотОбъект.Объект.Дата);
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Проведение, Истина);	Записать(ПараметрыЗаписи); //проведение текущего документа 
	НомерЗаявки = ЭтотОбъект.Объект.НомерЗаявки;    ПровестиПродажуОпционов(НомерЗаявки); 
КонецПроцедуры 

// обновление данных элмента справочника
Процедура ПродажаОпционов(ПакетыОпционов, Дата)          Если ЭтотОбъект.Объект.Количество > ЭтотОбъект.Объект.ДоступныеОпционы Тогда        Сообщить("Ошибка: Количество опционов для продажи не может превышать доступные опционы!");        Отказ = Истина;        Возврат;    КонецЕсли;     Если ПакетыОпционов = Неопределено Тогда        Сообщить("Ошибка: Пакет опционов не выбран!");        Возврат;    КонецЕсли;    ОбъектПакета = ПакетыОпционов.ПолучитьОбъект();  
	ЭтотОбъект.Объект.ПричинаОтклонения = "";
	ОбъектПакета.ВызревшиеОпционы = ЭтотОбъект.Объект.ДоступныеОпционы;    ОбъектПакета.ПроданныеОпционы = ОбъектПакета.ПроданныеОпционы + ЭтотОбъект.Объект.Количество;    ОбъектПакета.Записать();
КонецПроцедуры   

Процедура ПровестиПродажуОпционов(НомерЗаявки)  	Если ПустаяСтрока(НомерЗаявки) Тогда        Сообщить("Ошибка: Номер документа 'ПродажаОпционов' не указан!");    Возврат;	КонецЕсли;    
	// поиск документа "ПродажаОпционов" по номеру    Запрос = Новый Запрос;    Запрос.Текст =         "ВЫБРАТЬ ПЕРВЫЕ 1         | ССЫЛКА         |ИЗ Документ.ЗаявкаНаПродажуОпционов        |ГДЕ Номер = &НомерЗаявки";        Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);    Результат = Запрос.Выполнить();        Если Результат.Пустой() Тогда        Сообщить("Ошибка: Не найден документ 'ПродажаОпционов' с номером " + НомерЗаявки);        Возврат;    КонецЕсли;        Выборка = Результат.Выбрать();    Выборка.Следующий();    ДокПродажа = Выборка.Ссылка.ПолучитьОбъект();        // Проведение документа заявки 
	ДокПродажа.Статус = Перечисления.СтатусЗаявки.Одобрена;     ДокПродажа.Записать(РежимЗаписиДокумента.Проведение); 

КонецПроцедуры  


&НаКлиентеПроцедура ОтклонитьПродажуКоманда(Команда)      
	ТекущаяПричина = ЭтотОбъект.Объект.ПричинаОтклонения; 
	ПараметрыВвода = Новый Структура("ПриемникПричины",ТекущаяПричина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПричины",ЭтаФорма);
	ОткрытьФорму("Документ.РеализацияОпционов.Форма.ФормаВводаПричины",ПараметрыВвода,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	//открытие формы ввода причины    
КонецПроцедуры  

&НаКлиентеПроцедура ПослеВыбораПричины(Результат, ДопПараметры) Экспорт    Если Результат = Неопределено Тогда        Возврат;    КонецЕсли;    ЭтотОбъект.Объект.ПричинаОтклонения = Результат;       // получение причины отклонения
	НомерЗаявки = ЭтотОбъект.Объект.НомерЗаявки;
	ОтклонитьПродажуОпционов(НомерЗаявки);  	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, Закрыть", РежимЗаписиДокумента.Проведение, Истина);
	Записать(ПараметрыЗаписи);
Конецпроцедуры

// отклонение продажи опционов
Процедура ОтклонитьПродажуОпционов(НомерЗаявки)  
	Если ПустаяСтрока(НомерЗаявки) Тогда
        Сообщить("Ошибка: Номер документа 'ПродажаОпционов' не указан!");
    Возврат;
    КонецЕсли;
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1 
        | ССЫЛКА 
        |ИЗ Документ.ЗаявкаНаПродажуОпционов
        |ГДЕ Номер = &НомерЗаявки";
    
    Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        Сообщить("Ошибка: Не найден документ 'ПродажаОпционов' с номером " + НомерЗаявки);
        Возврат;
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    Выборка.Следующий();
    ДокПродажа = Выборка.Ссылка.ПолучитьОбъект();
    
    // проведение документа и запись причины в примечание 
	ДокПродажа.Статус = Перечисления.СтатусЗаявки.Отклонена;
	ДокПродажа.Примечание = "Причина отклонения - " + ЭтотОбъект.Объект.ПричинаОтклонения;
    ДокПродажа.Записать(РежимЗаписиДокумента.Проведение); 

КонецПроцедуры
